Revit 2027 API
FilteredElementCollector.ContainedInDesignOption Method
 Applies an ElementDesignOptionFilter to the collector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FilteredElementCollector ContainedInDesignOption(
	ElementId designOptionId
)
Public Function ContainedInDesignOption (
	designOptionId As ElementId
) As FilteredElementCollector
public:
FilteredElementCollector^ ContainedInDesignOption(
	ElementId^ designOptionId
)
member ContainedInDesignOption :
        designOptionId : ElementId -> FilteredElementCollector
Parameters
designOptionId ElementId
 The design option id.
Return Value
FilteredElementCollector
 A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only elements that are contained by this particular design option will pass the collector. If you have an active iterator to this collector it will be stopped by this call.
See Also
Reference
FilteredElementCollector Class
Autodesk.Revit.DB Namespace